app/controllers/posts_controller.rb

SELECT * FROM "posts" ORDER BY ifnull(post_id, id) desc, updated_at asc
---
  def index
    @posts = Post.find_all_and_thread

INSERT INTO "posts" ("created_at", "updated_at", "post_id", "user_id", "message") VALUES('2010-09-25 02:10:39', '2010-09-25 02:10:39', NULL, 10, 'this is the latest post
---
  def create
    success = false;
    if (session[:user])
      @post = Post.new(params[:post])
      @post[:user_id] = session[:user][:id]
      success = @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 6)
UPDATE "posts" SET "updated_at" = '2010-09-24 18:33:49', "message" = 'this is a reply to the first post 1' WHERE "id" = 6
---
  def update
    success = false;
    if (session[:user])
      @post = Post.find(params[:id])
      if (@post.user == session[:user])
        success = @post.update_attributes(params[:post])

SELECT * FROM "posts" WHERE ("posts"."id" = 5)
DELETE FROM "posts" WHERE "id" = 5
---
  def destroy
    if (session[:user])
      @post = Post.find(params[:id])
      if (@post.user == session[:user] || session[:user].admin == 1)
        Post.destroyCascade(@post)

SELECT * FROM "posts" WHERE ("posts"."id" = '--- :one
---
  def cheer
    if (session[:user])
      @post = Post.find(params[:post_id])