app/controllers/users_controller.rb

  def index
    if (session[:user] && session[:user].admin == 1)
       @users = User.all
---
SELECT * FROM "users"

  def create
    @user = User.new(params[:user])
    if (User.all().size == 0)
      @user.admin = 1
    end

    respond_to do |format|
      if @user.save
---
SELECT * FROM "users"
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password", "admin") VALUES('mary', '194383100.0682983937116666', '2010-09-27 00:12:31', '2010-09-27 00:12:31', '49400adc151e8e0c905e6290ad9da118eeb2a682', 0)

  def update
    @user = User.find(params[:id])
    success = false
    if (session[:user] == @user || session[:user].admin == 1)
      success = @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 13)
UPDATE "users" SET "updated_at" = '2010-09-27 01:26:52', "salt" = '186297600.00889972988474097', "hashed_password" = '344ede40ff034eb28eb83d6e3176a89816f87a07', "name" = 'a' WHERE "id" = 10

  def destroy
    @user = User.find(params[:id])
    if (session[:user] && session[:user].admin == 1)
      User.destroyCascade(@user)
---
SELECT * FROM "users" WHERE ("users"."id" = 9)
DELETE FROM "users" WHERE "id" = 9

  def createAdmin
    success = false
    @user = User.new(params[:user])
    if (!session[:user] || session[:user].admin == 0)
        flash[:notice] = "Only administrators can create administrators"
    else
      success = @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password", "admin") VALUES('g', '191705300.50811171593573', '2010-09-27 00:57:29', '2010-09-27 00:57:29', '7eaf4fda1cdf17af817382ac90d40bc89ea3076d', 1)